import React from "react";
import { Link } from "react-router-dom";

const Privacy = () => {
  return (
    <div className="project" style={{ direction: "rtl" }}>
      <div className="banner">
        <h3>سياسة الخصوصية </h3>
        <p style={{ direction: "ltr" }}>
          <Link to="/">الرئيسية</Link>
        </p>
      </div>
      <div className="content" style={{ justifyContent: "flex-start" }}>
        <h2>الموافقة على الشروط</h2>
        <p>
          تشكل شروط الاستخدام هذه اتفاقية ملزمة قانونًا بينك ، سواء شخصيًا أو
          نيابة عن كيان ("أنت") وشركة Little Thinking Minds LTD ("الشركة" أو
          "نحن" أو "نحن" أو "خاصتنا") ، فيما يتعلق بوصولك إلى واستخدامه بالإضافة
          إلى أي نموذج وسائط آخر أو قناة وسائط أو موقع ويب للهاتف المحمول أو
          تطبيق جوال مرتبط به أو مرتبط به أو متصل به (يشار إليه إجمالاً بـ
          "الموقع"). أنت توافق على أنه من خلال الوصول إلى الموقع ، تكون قد قرأت
          وفهمت وتوافق على الالتزام بجميع شروط الاستخدام هذه. إذا كنت لا توافق
          على جميع شروط الاستخدام هذه ، فأنت ممنوع صراحة من استخدام الموقع ويجب
          عليك التوقف عن استخدامه على الفور.
        </p>
        <br />
        <p>
          الشروط والأحكام التكميلية أو المستندات التي قد يتم نشرها على الموقع من
          وقت لآخر مدرجة بموجب هذا صراحةً هنا بالإشارة إليها. نحتفظ بالحق ،
          وفقًا لتقديرنا الخاص ، في إجراء تغييرات أو تعديلات على شروط الاستخدام
          هذه في أي وقت ولأي سبب. سننبهك بأي تغييرات عن طريق تحديث تاريخ "آخر
          تحديث" لشروط الاستخدام هذه ، وأنت تتنازل عن أي حق في تلقي إشعار محدد
          لكل تغيير من هذا القبيل. تقع على عاتقك مسؤولية مراجعة شروط الاستخدام
          هذه بشكل دوري للبقاء على اطلاع على التحديثات. ستخضع للتغييرات في أي
          شروط استخدام معدلة من خلال استمرار استخدامك للموقع بعد تاريخ نشر شروط
          الاستخدام المعدلة هذه ، وستعتبر أنك قد علمت بها وقبلتها.
        </p>
        <br />
        <p>
          لم يتم تصميم الموقع بحيث يتوافق مع اللوائح الخاصة بالصناعة (قانون
          التأمين الصحي لقابلية النقل والمساءلة (HIPAA) ، والقانون الفيدرالي
          لإدارة أمن المعلومات (FISMA) ، وما إلى ذلك) ، لذلك إذا كانت تفاعلاتك
          ستخضع لمثل هذه القوانين ، فلا يجوز لك استخدم هذا الموقع. لا يجوز لك
          استخدام الموقع بطريقة تنتهك قانون Gramm-Leach-Bliley (GLBA).
        </p>
        <br />
        <p>
          يجب أن يحصل جميع المستخدمين القصر في الولاية القضائية التي يقيمون فيها
          (بشكل عام أقل من 18 عامًا) على إذن من والديهم أو الوصي عليهم ، ويشرف
          عليهم مباشرة لاستخدام الموقع. إذا كنت قاصرًا ، يجب أن يقرأ والديك أو
          ولي أمرك ويوافق على شروط الاستخدام هذه قبل استخدامك للموقع.
        </p>
        <br />
        <h4>حقوق الملكية الفكرية</h4>
        <p>
          ما لم تتم الإشارة إلى خلاف ذلك ، فإن الموقع هو ملكية خاصة بنا وجميع
          التعليمات البرمجية المصدر وقواعد البيانات والوظائف والبرامج وتصميمات
          مواقع الويب والصوت والفيديو والنصوص والصور الفوتوغرافية والرسومات
          الموجودة على الموقع (يشار إليها مجتمعة باسم "المحتوى") والعلامات
          التجارية والخدمة العلامات والشعارات الواردة فيها ("العلامات") مملوكة
          لنا أو خاضعة لسيطرتنا أو مرخصة لنا ، وهي محمية بموجب قوانين حقوق النشر
          والعلامات التجارية ومختلف حقوق الملكية الفكرية الأخرى وقوانين المنافسة
          غير العادلة في الولايات المتحدة ، وقوانين حقوق النشر الدولية ،
          والاتفاقيات الدولية. يتم توفير المحتوى والعلامات على الموقع "كما هي"
          لمعلوماتك واستخدامك الشخصي فقط. باستثناء ما هو منصوص عليه صراحةً في
          شروط الاستخدام هذه ، لا يجوز نسخ أي جزء من الموقع ولا محتوى أو علامات
          أو إعادة إنتاجها أو تجميعها أو إعادة نشرها أو تحميلها أو نشرها أو
          عرضها علنًا أو ترميزها أو ترجمتها أو نقلها أو توزيعها أو بيعها أو
          ترخيصها أو تم استغلالها لأي غرض تجاري على الإطلاق ، دون إذن كتابي صريح
          مسبق منا.
        </p>
        <br />
        <p>
          شريطة أن تكون مؤهلاً لاستخدام الموقع ، يتم منحك ترخيصًا محدودًا للوصول
          إلى الموقع واستخدامه وتنزيل أو طباعة نسخة من أي جزء من المحتوى الذي
          حصلت على حق الوصول إليه بشكل صحيح فقط لأغراضك الشخصية غير التجارية
          استعمال. نحتفظ بجميع الحقوق غير الممنوحة لك صراحةً في الموقع والمحتوى
          والعلامات.
        </p>
        <br />
        <br />
        <h3>
          إقرارات المستخدم
          <br />
          <br />
          باستخدام الموقع ، فإنك تقر وتضمن ما يلي :
        </h3>
        <p>
          ستكون جميع معلومات التسجيل التي ترسلها صحيحة ودقيقة وحديثة وكاملة سوف
          تحافظ على دقة هذه المعلومات وتقوم على الفور بتحديث معلومات التسجيل عند
          الضرورة لديك الأهلية القانونية وتوافق على الامتثال لشروط الاستخدام هذه
          لست قاصرًا في الولاية القضائية التي تقيم فيها ، أو إذا كنت قاصرًا ،
          فقد تلقيت إذنًا من الوالدين لاستخدام الموقع لن تتمكن من الوصول إلى
          الموقع من خلال وسائل آلية أو غير بشرية ، سواء من خلال روبوت أو نص
          برمجي أو غير ذلك لن تستخدم الموقع لأي غرض غير قانوني أو غير مصرح به ؛
          و (7) لن ينتهك استخدامك للموقع أي قانون أو لائحة معمول بها إذا قدمت أي
          معلومات غير صحيحة أو غير دقيقة أو غير حديثة أو غير كاملة ، فيحق لنا
          تعليق حسابك أو إنهائه ورفض أي وجميع
        </p>
      </div>
    </div>
  );
};

export default Privacy;
